<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class StandardSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Schema::disableForeignKeyConstraints();
        \App\Models\Standard::truncate();
        \App\Models\SubStandard::truncate();
        \App\Models\Indicator::truncate();
        \Illuminate\Support\Facades\Schema::enableForeignKeyConstraints();

        $standardsData = [
            [
                'number' => '1',
                'name' => 'الرسالة والأهداف ومخرجات التعلم',
                'description' => 'يتعلق هذا المعيار برسالة واهداف ومخرجات التعلم للبرنامج الأكاديمي ويجب أن تكون الرسالة واضحة ومرتبطة بأهداف ومخرجات تعلم البرنامج وتساهم في تحقيق رسالة الجامعة وتكون معلنة وتراجع بصورة دورية .',
                'sub_standards' => [
                    [
                        'number' => '1-1',
                        'name' => 'رسالة وأهداف البرنامج',
                        'examples_of_evidence' => [
                        'مصفوفة اتساق رسالة وأهداف البرنامج مع رؤية ورسالة وأهداف الجامعة والكلية ورسالة وأهداف القسم.',
                        'المحاضر والتقارير المعتمدة التي توثق عمل اللجنة الاستشارية للبرنامج ومشاركتها في إعداد ومراجعة رسالة وأهداف البرنامج',
                        ' محاضر مجالس الأقسام والكليات والجامعة التي توثق مراجعة الرسالة والأهداف بشكل دوري مع عرض لتطور الرسالة والأهداف ',
                        'أشكال التوثيق للإعلان عن أهداف البرنامج ورسالته وتعميمها على الجهات المعنية (صور فوتوغرافية للندوات وورش العمل، إعلانات، مخاطبات ومراسلات).'
                    ],
                        'indicators' => [
                            ['number' => '1-1-1', 'name' => 'أن يكون لدى البرنامج رسالة واهداف واضحة ومعلنة ومعتمدة من مجالس الجامعة وتراجع بشكل دوري.'],
                            ['number' => '2-1-1', 'name' => 'وجود لجنة استشارية للبرنامج مكونة من جميع اصحاب العلاقة (أعضاء هيئة التدريس، الطلبة، الخريجين، ارباب العمل والمجتمع المحلي)، تشارك في اعداد ومراجعة الرسالة والأهداف وتوثق بمحاضر او تقارير معتمدة.'],
                            ['number' => '3-1-1', 'name' => 'وجود إجراءات واضحة وموثقة للمراجعة الدورية للرسالة والاهداف.'],
                            ['number' => '4-1-1', 'name' => 'استناد رسالة واهداف البرنامج إلى مرجعيات محلية وإقليمية ودولية وتتسق مع رسالة الجامعة.'],
                        ]
                    ],
                    [
                        'number' => '2-1',
                        'name' => 'مخرجات التعلم ومواصفات الخريجين',
                        'examples_of_evidence' => [
                        'المحاضر والتقارير المعتمدة التي توثق عمل اللجنة الاستشارية للبرنامج ومشاركتها في إعداد مخرجات العلم.',
                        'مصفوفة تحليل مخرجات التعلم للبرنامج ومدى شموليتها للمعارف والمهارات الذهنية والمهنية والعامة.',
                        'محاضر مجالس الأقسام والكليات والجامعة التي توثق مراجعة مخرجات التعلم بشكل دوري مع عرض لتطور  المخرجات',
                        'مصفوفة المواءمة لمخرجات تعلم البرنامج مع مخرجات تعلم البرامج المرجعية'
                        ],
                        'indicators' => [
                            ['number' => '1-2-1', 'name' => 'لدى البرنامج مخرجات تعلم تحدد وتصف المعارف والمهارات الذهنية والمهنية والعامة التي سيكتسبها الطالب عند التخرج وتكون واضحة وقابلة للقياس ومعلنة ومعتمدة من مجالس الجامعة وتراجع بشكل دوري.'],
                            ['number' => '2-2-1', 'name' => 'اعداد ومراجعة مخرجات تعلم البرنامج بمشاركة اللجنة الاستشارية المكونة من اصحاب العلاقة (أعضاء هيئة التدريس، الطلبة، الخريجين، ارباب العمل والمجتمع المحلي) لتلبي تطلعاتهم واحتياجات سوق العمل وتكون موثقة بمحاضر او تقارير معتمدة. '],
                            ['number' => '3-2-1', 'name' => 'وجود إجراءات وخطوات واضحة وموثقة للمراجعة الدورية لمخرجات تعلم البرنامج.'],
                            ['number' => '4-2-1', 'name' => 'استناد مخرجات تعلم البرنامج إلى المرجعيات المحلية والإقليمية والدولية وتتسق مع الاهداف.'],
                            ['number' => '5-2-1', 'name' => 'يحدد البرنامج مواصفات خريجيه، بما يتسق مع رسالته وأهدافه ومخرجات التعلم، ويتناسب مع مستوى المؤهل الأكاديمي، وتكون واضحة ومعلنة ويشارك في اعدادها أصحاب العلاقة من خلال جلسات موثقة في محاضر او تقارير معتمدة.'],
                            ['number' => '6-2-1', 'name' => 'تتوافق مواصفات الخريجين مع المعايير الأكاديمية والمهنية ومتطلبات التنمية وسوق العمل.'],
                        ]
                    ],
                ],
            ],
            [
                'number' => '2',
                'name' => 'إدارة البرنامج الأكاديمي',
                'description' => 'يتعلق هذا المعيار بوجود إدارة تقود البرنامج بكفاءة وتقوم بتطبيق الأنظمة والسياسات واللوائح المؤسسية بنزاهة وشفافية عبر مجالس متخصصة ولجان متنوعة ودعم مالي واداري مساند.',
                'sub_standards' => [
                    [
                        'number' => '1-2',
                        'name' => 'قيادة البرنامج',
                        'examples_of_evidence' => [
                        'محاضر عمل المجالس .',
                        'دليل إرشادي (إن وجد) يوصف مهام المجالس في المؤسسة وآلية عملها.',
                        'نتائج استطلاعات رأي قدمت لأعضاء هيئة التدريس حول مدى الرضا عن برامج التطوير المهني.',
                        'خطط لبرامج التطوير المهني المقدمة لأعضاء هيئة التدريس.',
                        'خطابات ترشيح لأعضاء هيئة التدريس لحضور برامج وشهادات حضور.',
                        'محاضر تشكيل اللجان المختلفة المكلفة بعمليات القياس والتقييم وتطوير المناهج والتظلمات والترقيات العلمية وغيرها من اللجان ومحاضر توثق عملها مع وجود آلية توثيق وأرشفة واضحة.',
                        'التقارير السنوية للبرنامج وللمقررات .',
                        'نتائج التقييمات الدورية للبرنامج (إن وجدت).'
                        ],
                        'indicators' => [
                            ['number' => '1-1-2', 'name' => 'لدى البرنامج قيادة فعالة  (منسق البرنامج ) تعمل جنبا الى جنب مع رئاسة القسم وتدير البرنامج بكفاءة عالية لتحقيق أهداف ورسالة البرنامج وضمان جودته وتتخذ القرارات المناسبة عبر مجالس متخصصة (مجلس الكلية ومجلس القسم).'],
                            ['number' => '2-1-2', 'name' => 'تدعم قيادة البرنامج التطوير المهني لأعضاء هيئة التدريس والاداريين بالبرنامج والمشاركة في الأنشطة البحثية والندوات والدورات العلمية.'],
                            ['number' => '3-1-2', 'name' => 'تشكل قيادة البرنامج اللجان المختلفة من أعضاء هيئة التدريس للقيام بعمليات القياس والتقييم وتطوير المناهج والتظلمات والترقيات العلمية ويشرك الطلبة في بعضها.e'],
                        ]
                    ],
                    [
                        'number' => '2-2',
                        'name' => 'الموارد الإدارية والمالية',
                        'examples_of_evidence' => ['احصائيات توضح الكادر الإداري للبرنامج.','الموازنة السنوية للبرنامج وتقارير مالية حول موارد البرنامج وآليات وبنود الصرف.'],
                        'indicators' => [
                            ['number' => '1-2-2', 'name' => 'يتوفر للبرنامج سكرتاريا وكادر إداري كافٍ ومناسب.'],
                            ['number' => '2-2-2', 'name' => 'يتوفر للبرنامج التمويل المالي الكافي للقيام بمهامه وتحقيق رسالته وأهدافه.'],
                            ['number' => '3-2-2', 'name' => 'وجود لدى البرنامج أرشيف متكامل يوثق جميع القرارات والتقارير والأنشطة ومحاضر الاجتماعات وعمل اللجان المختلفة.'],
                        ]
                    ],
                ],
            ],
            [
                'number' => '3',
                'name' => 'المنهاج الدراسي',
                'description' => 'يتعلق هذا المعيار بالمنهاج الدراسي للبرنامج الذي يجب ان يتم تحديده بدقة بحيث يغطي جميع مخرجات تعلم البرنامج بما يضمن تحقيقها ويكون متوافق مع المعايير الأكاديمية والمرجعيات الإقليمية والدولية ومتطلبات سوق العمل.',
                'sub_standards' => [
                    [
                        'number' => '1-3',
                        'name' => 'محتوى المنهاج الدراسي',
                        'examples_of_evidence' => [
                            'قرارات تشكيل لجان تطوير البرامج',
                            'محاضر اجتماعات اللجان التي قامت بتطوير البرامج.',
                            'مصفوفة المواءمة بين البرنامج والبرامج المناظرة المعتمدة.',
                            'الخطة الدراسية.',
                            'متطلبات الجامعة والكلية والتخصص.',
                            'تحليل استطلاعات الرأي للطلبة والمعلمين وجهات العمل والخريجين لتقييم الخطة الدراسية وتقييم البرنامج وآليات تنفيذه.',
                            'تقارير الزيارات الميدانية المنفذة للطلبة للمؤسسات ذات العلاقة بالتخصص ',
                            'نماذج من المخاطبات مع المؤسسات ذات العلاقة بالتخصص.',
                            'عينة من ملفات المقررات '
                        ],
                        'indicators' => [
                            ['number' => '1-1-3', 'name' => 'تحديد المقررات الدراسية وعدد الساعات لكل مقرر وتوزيعها على الجانب النظري والتطبيقي استنادا على البرامج المناظرة المعتمدة محليا وإقليميا ودوليا ومتطلبات سوق العمل على أن تحدد عدد الساعات الاجمالية للبرنامج بعدد (31-33) ساعة معتمدة مضروبا في عدد السنوات الدراسية للبرنامج.'],
                            ['number' => '2-1-3', 'name' => 'تصميم الخطة الدراسية وتوزيع المقررات الدراسية على الفصول الدراسية بشكل متوازن ويراعي فيها التسلسل والترابط بين المقررات الدراسية.'],
                            ['number' => '3-1-3', 'name' => 'لدى كل مقرر دراسي توصيف شامل لمحتوى المقرر ومخرجاته التعليمية وطرق وأساليب التدريس والقياس والتقويم وفق للقالب المعتمد يطبق ويوزع للطلاب بداية كل فصل دراسي.'],
                            ['number' => '4-1-3', 'name' => 'ارتباط المقررات الدراسية ومحتواها ومخرجاتها وطرق قياسها بمخرجات تعلم البرنامج لضمان اكتساب الخريجين المعارف والمهارات  الذهنية والمهنية والعامة في مخرجات تعلم البرنامج.'],
                            ['number' => '5-1-3', 'name' => 'يتوفر لكل مقرر ملف يعده أستاذ المقرر في كل فصل دراسي يدرس فيه المقرر يحتوي على توصيف المقرر والمادة العلمية والكتاب المرجعي ونماذج من أدوات القياس (اختبارات وغيرها) ونتائج الطلبة (ضعيف - متوسط - ممتاز) وتقرير المقرر واستبانة الطلبة.'],
                        ]
                    ],
                    [
                        'number' => '2-3',
                        'name' => 'الأنشطة الداعمة للمنهاج الدراسي',
                        'examples_of_evidence' => ['نماذج للأنشطة اللاصفية التي عقدت لإثراء خبرات الطلبة ونماذج للإعلانات عن هذه الأنشطة.'],
                        'indicators' => [
                            ['number' => '1-2-3', 'name' => 'يقدم البرنامج للطلاب فرص تدريب وزيارات ميدانية في مجالات العمل المتعلقة بالتخصص.'],
                            ['number' => '2-2-3', 'name' => 'يقيم البرنامج الورش العملية والدورات التدريبية والندوات للطلاب من خلال استضافة المختصين من ذوي الخبرات العملية. '],
                        ]
                    ],
                ],
            ],
            [
                'number' => '4',
                'name' => 'مرافق وتجهيزات البرنامج',
                'description' => 'يتعلق هذا المعيار بمصادر التعلم ومرافق وتجهيزات البرنامج المختلفة التي يجب ان تكون كافية ومناسبة لتلبية احتياجات البرنامج لتحقيق الرسالة والاهداف ومخرجات التعلم، وتتاح لجميع المستفيدين من اعضاء هيئة التدريس والطلبة.',
                'sub_standards' => [
                    [
                        'number' => '1-4',
                        'name' => 'المرافق التعليمية والخدماتية',
                        'examples_of_evidence' => [
                            'قوائم حصر بالأثاث والتجهيزات المرصودة للبرنامج وأعضاء هيئة التدريس فيه من مكاتب وكمبيوترات وغيرها من التجهيزات .',
                            'صور من الاتفاقيات المبرمة مع المستشفيات ان لم يوجد مستشفى تعليمي خاص بالبرنامج',
                            'قوائم حصر مع صور للتجهيزات التعليمية من مختبرات حاسوب ومختبرات علمية',
                            'تحليل استطلاعات الرأي للطلاب وأعضاء هيئة التدريس لتحديد مدى الرضا عن الخدمات والتجهيزات والمرافق المتاحة للبرنامج.'
                        ],
                        'indicators' => [
                            ['number' => '1-1-4', 'name' => 'يتوفر لدى البرنامج مكاتب مناسبة لأعضاء هيئة التدريس والموظفين وقاعات تدريس كافية لاستيعاب الطلبة وقاعات للمكتبة مؤثثة ومزودة بالتجهيزات اللازمة.'],
                            ['number' => '2-1-4', 'name' => 'يتوفر لدى البرنامج مرافق وتجهيزات تعليمية تخصصية بحسب طبيعة كل برنامج (مختبرات الحاسوب والانترنت، مختبرات وأجهزة ومعدات تخصصية) بالإضافة إلى توفر مستشفى جامعي أو تعليمي رئيسي أو إبرام اتفاقيات مع مستشفيات رئيسة لضمان تدريس المرحلة السريرية للتخصصات الطبية وتكون جميع المرافق مناسبة من حيث المساحة والتهوية والاضاءة وتراعي ذوي الاحتياجات الخاصة.'],
                            ['number' => '3-1-4', 'name' => 'وجود مرافق خدماتية متنوعة (دورات مياه – مطاعم – قاعات نشاطات – صالات رياضية – أماكن للصلاة – استراحات - مواقف خاصة لوسائل النقل – ورش الصيانة) وتراعي ذوي الاحتياجات الخاصة.'],
                        ]
                    ],
                    [
                        'number' => '2-4',
                        'name' => 'مصادر التعلم',
                        'examples_of_evidence' => ['قوائم بالمراجع ومصادر التعلم من الكتب الورقية والالكترونية  والمواقع التعليمية الالكترونية وقواعد البيانات المتاحة للطلاب وأعضاء هيئة التدريس.'],
                        'indicators' => [
                            ['number' => '1-2-4', 'name' => 'يتوفر لدى البرنامج مصادر تعلم كافية من مراجع وكتب علمية (ورقية وإلكترونية) ومواقع تعليمية إلكترونية وبرمجيات مناسبة لتنفيذ الخطة الدراسية وتحقيق الرسالة والاهداف ومخرجات التعلم. '],
                        ]
                    ],
                    [
                        'number' => '3-4',
                        'name' => 'الأمن والسلامة',
                        'examples_of_evidence' => [' دليل إجراءات الأمن والسلامة '],
                        'indicators' => [
                            ['number' => '1-3-4', 'name' => ' يجب أن تكون جميع المرافق التعليمية والخدماتية مزودة بأدوات الامن والسلامة.'],
                            ['number' => '2-3-4', 'name' => ' تتوفر إرشادات دقيقة وواضحة عن استخدام أدوات الامن والسلامة والأجهزة والمواد الكيميائية المتوفرة في المعامل والورش والمختبرات بشكل امن وسليم.'],
                        ]
                    ],
                ],
            ],
            [
                'number' => '5',
                'name' => 'الطلبة',
                'description' => 'يتعلق هذا المعيار بسياسات وأنظمة قبول وتسجيل ونقل الطلبة ووضع قواعد للسلوك القويم وإجراءات للتأديب والتظلم تتصف بالشفافية والنزاهة، كما يجب ان تكون حقوق وواجبات الطلبة محددة ومعلنة وملتزم بها، وان تتوفر آليات فعاّلة للتوجيه والإرشاد وتقديم جميع الخدمات التي يحتاجها الطلبة بعدالة.',
                'sub_standards' => [
                    [
                        'number' => '1-5',
                        'name' => 'القبول والتسجيل والنقل',
                        'examples_of_evidence' => [
                            ' لائحة القبول والتسجيل .',
                            'إعلانات فتح باب القبول.',
                            'إعلانات إجراءات المفاضلة. ',
                            'نماذج لاختبارات القبول والمفاضلة.',
                            'إحصائية مقارنة تبين نسبة أعداد الطلبة الى أعضاء هيئة التدريس.',
                            'اللوائح المنظمة لحقوق الطلبة وواجباتهم واللوائح التأديبية واللوائح المنظمة للانتقال والمعادلات.'
                        ],
                        'indicators' => [
                            ['number' => '1-1-5', 'name' => ' تتوفر لدى البرنامج معايير وإجراءات واضحة ومعلنة لنظام قبول وتسجيل الطلبة تطبق بعدالة ونزاهة وشفافية.'],
                            ['number' => '2-1-5', 'name' => ' يتناسب عدد الطلبة المقبولين في البرنامج مع الطاقة الاستيعابية للقاعات الدراسية والمختبرات والمرافق العامة ويتوافق مع النسب المعتمدة بين أعضاء هيئة التدريس والطلبة.'],
                            ['number' => '3-1-5', 'name' => ' لدى البرنامج سياسات وإجراءات تحدد نجاح ورسوب الطلبة والية الانتقال إلى البرنامج من برامج مناظرة، وكيفية معادلة المقررات التي درسها الطالب في البرنامج المنتقل منه.'],
                            ['number' => '4-1-5', 'name' => ' وجود لوائح وإجراءات تحدد المخالفات الطلابية والعقوبات التأديبية لها وإجراءات التظلم والشكاوى وإيقاف القيد والانسحاب من البرنامج تطبق بعدالة ونزاهة وشفافية.'],
                        ]
                    ],
                    [
                        'number' => '2-5',
                        'name' => 'المتابعة والإرشاد الأكاديمي',
                        'examples_of_evidence' => [' شرح لآلية الإرشاد الأكاديمي وتوزيع الطلبة على المرشدين.','استطلاعات رأي تبين تقييم الطلبة لجهود الإرشاد الأكاديمي والأنشطة الطلابية','نماذج لحالات تم التعامل معها من قبل المرشد الأكاديمي.'],
                        'indicators' => [
                            ['number' => '1-2-5', 'name' => ' يتم تقديم برامج لتهيئة الطلبة الجدد، وتوجيههم بما يضمن فهمهم الكامل لأنواع الخدمات والإمكانيات المتاحة وحقوقهم وواجباتهم اثناء دراستهم في البرنامج والتحقق من اداءهم ونتائجهم واستيفاءهم لمتطلبات التخرج.'],
                            ['number' => '2-2-5', 'name' => ' يتوافر لطلاب البرنامج خدمات فعالة للإرشاد الأكاديمي والنفسي والسلوكي والاجتماعي، وفق خطط وبرامج محددة، ومن خلال كوادر متخصصة ومؤهلة وكافية ومناسبة، بما يتناسب واحتياجاتهم، وتحدد الآليات لمتابعة تنفيذها.'],
                        ]
                    ],
                    [
                        'number' => '3-5',
                        'name' => 'الفعاليات والخدمات الطلبة',
                        'examples_of_evidence' => ['نماذج لإعلانات الأنشطة الطلابية وتقارير إنجازها.','نتائج استطلاعات رأي للطلبة يقيمون فيه الفعاليات والخدمات المقدمة لهم'],
                        'indicators' => [
                            ['number' => '1-3-5', 'name' => ' وجود تفاعل إيجابي بين الطلبة وأعضاء هيئة التدريس من خلال إقامة الفعاليات المتعددة لتنمية قدراتهم ومهاراتهم.'],
                            ['number' => '2-3-5', 'name' => ' يحفز البرنامج إبداعات الطلبة وابتكاراتهم وإقامة الأنشطة الداعمة لها.'],
                            ['number' => '3-3-5', 'name' => ' ان يشجع البرنامج مشاركة الطلبة في الأنشطة الرياضية والترفيهية المختلفة. '],
                        ]
                    ],
                ],
            ],
            [
                'number' => '6',
                'name' => 'هيئة التدريس',
                'description' => 'يتعلق هذا المعيار بمدى كفاءة أعضاء الهيئة التدريسية لتحقيق أهداف البرنامج الأكاديمي ومخرجات التعلم حيث يجب أن يتوفر العدد الكافي من اعضاء هيئة التدريس ذوي الخبرات والمؤهلات المطلوبة لتغطية كافة مجالات التخصص.',
                'sub_standards' => [
                    [
                        'number' => '1-6',
                        'name' => 'كفاءة و أداء عضو هيئة التدريس',
                        'examples_of_evidence' => [
                            ' إحصائية بأعضاء هيئة التدريس توضح تخصصاتهم وأنصبتهم التدريسية  ونسبتهم الى الطلبة.',
                            'إحصائية بالأنشطة البحثية والعلمية لأعضاء هيئة التدريس.',
                            'لائحة ترقيات وتقاعد أعضاء هيئة التدريس.',
                            'تحليل استبانة قياس رضا الطلبة عن أداء أعضاء هيئة التدريس.'
                        ],
                        'indicators' => [
                            ['number' => '1-1-6', 'name' => ' يتوفر لدى البرنامج العدد الكافي من اعضاء هيئة التدريس ذوي المؤهلات اللازمة لتغطية كافة مجالات البرنامج بنصاب تدريسي يتناسب مع درجاتهم العلمية وفق اللوائح الجامعية.'],
                            ['number' => '2-1-6', 'name' => ' يقوم أعضاء هيئة التدريس بأداء مهامهم التدريسية والبحثية بكفاءة عالية لتحقيق أهداف البرنامج الأكاديمي ومخرجات التعلم ويشاركوا بفعالية في أنشطة تقويم وتطوير البرنامج.'],
                            ['number' => '3-1-6', 'name' => ' ان تتوفر سياسات وإجراءات عادلة وشفافة ونزيهة لترقية أعضاء هيئة التدريس ولاختيار أعضاء هيئة التدريس الجدد وآلية التقاعد.'],
                        ]
                    ],
                    [
                        'number' => '2-6',
                        'name' => 'التطوير المهني',
                        'examples_of_evidence' => [
                            ' خطط برامج تهيئة وتدريب أعضاء هيئة التدريس الجدد.',
                            'خطط وبرامج التطوير المهني لأعضاء هيئة التدريس.',
                            'نماذج لشهادات الحضور لأعضاء هيئة التدريس في المشاركات العلمية.',
                            'نماذج لأبحاث أعضاء هيئة التدريس.',
                            'نماذج لأنشطة نفذها أعضاء هيئة التدريس لتطوير البرنامج.'

                        ],
                        'indicators' => [
                            ['number' => '1-2-6', 'name' => ' تقديم برامج فعَّالة في المجال التربوي والمهني والأكاديمي لتهيئة وتدريب وتوجيه وارشاد هيئة التدريس الجدد لضمان إحاطتهم بأهداف ومخرجات التعلم وخطط البرنامج وفهم حقوقهم ومسؤولياتهم.'],
                            ['number' => '2-2-6', 'name' => ' تقديم برامج نوعية في مجال التطوير المهني والأكاديمي لأعضاء هيئة التدريس لمواكبة التطورات الحديثة وفق خطة تلبي احتياجاتهم وتسهم في تطوير أدائهم.'],
                            ['number' => '3-2-6', 'name' => ' يشارك اعضاء هيئة التدريس في المؤتمرات والندوات والانشطة العلمية، والخدمة المجتمعية.'],
                        ]
                    ],
                ],
            ],
            [
                'number' => '7',
                'name' => 'التقييم والتحسين المستمر',
                'description' => 'يتعلق هذا المعيار بقياس وتقييم مخرجات المقررات الدراسية ومخرجات تعلم البرنامج مع وضع الخطط التحسينية اللازمة لضمان جودة البرنامج.',
                'sub_standards' => [
                    [
                        'number' => '1-7',
                        'name' => 'القياس والتقييم',
                        'examples_of_evidence' => [
                        ' نتائج تحليل استطلاع الرأي للطلاب والخريجين وجهات التوظيف وأعضاء هيئة التدريس والكادر الإداري.',
                        'دليل قياس مخرجات التعلم.',
                        'نماذج لتوصيفات المقررات (قبل وبعد التطوير للمقارنة).',
                        'نماذج لتقارير المقررات وتقارير البرنامج.',
                        'محاضر اجتماعات لجان تطوير المناهج.'
                    ],
                        'indicators' => [
                            ['number' => '1-1-7', 'name' => ' يتوافر لكل مقرر دراسي خطة قياس مدى تحقيق الطلبة لمخرجات التعلم للمقرر باستخدام وسائل متنوعة تتوافق مع محتوى المقرر بالإضافة لوجود استبانة الطلبة وتقرير المقرر.'],
                            ['number' => '2-1-7', 'name' => ' يتوافر لدى البرنامج خطة قياس مدى تحقيق الطلبة لمخرجات تعلم البرنامج باستخدام طرق متنوعة تتوافق مع طبيعة كل مخرج بالإضافة لوجود استبانة الطلبة والخريجين وتقرير لكل مخرج.'],
                            ['number' => '3-1-7', 'name' => ' تقييم نتائج قياس مخرجات تعلم المقررات الدراسية واتخاذ القرارات المناسبة للتحسين.'],
                            ['number' => '4-1-7', 'name' => ' تقييم نتائج قياس مخرجات التعلم البرنامج واتخاذ القرارات المناسبة للتحسين.'],
                        ]
                    ],
                    [
                        'number' => '2-7',
                        'name' => 'التحسين المستمر',
                        'examples_of_evidence' => [' خطط تحسين البرنامج وآليات تنفيذها وتقييم هذا البرنامج.'],
                        'indicators' => [
                            ['number' => '1-2-7', 'name' => ' يتوافر لدى البرنامج خطة مزمنة لتحسين البرنامج وفقا لنتائج تقييم مخرجات التعلم وتنفذ بشكل كامل باتخاذ الإجراءات اللازمة للتحسين.'],
                            ['number' => '2-2-7', 'name' => ' يتوفر لدى البرنامج ملف (ارشيف) يحتوي على خطة قياس مخرجات التعلم واستبانة الطلبة والخريجين والتقرير لكل مخرج بالإضافة الى خطة تحسين البرنامج وادلة تنفيذها.'],
                        ]
                    ],
                ],
            ],
        ];

        foreach ($standardsData as $sData) {
            $standard = \App\Models\Standard::create([
                'number' => $sData['number'],
                'name' => $sData['name'],
                'description' => $sData['description'],
            ]);

            foreach ($sData['sub_standards'] as $subData) {
                $subStandard = \App\Models\SubStandard::create([
                    'number' => $subData['number'],
                    'name' => $subData['name'],
                    'standard_id' => $standard->id,
                    'examples_of_evidence' => $subData['examples_of_evidence'],
                ]);

                foreach ($subData['indicators'] as $indicatorData) {
                    \App\Models\Indicator::create([
                        'number' => $indicatorData['number'],
                        'name' => $indicatorData['name'],
                        'sub_standard_id' => $subStandard->id,
                    ]);
                }
            }
        }
    }
}
